Revit 2027 API
KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType) Method
 Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<KeyBasedTreeEntryError> GetKeyBasedTreeEntryErrors(
	KeyBasedTreeEntryErrorType type
)
Public Function GetKeyBasedTreeEntryErrors (
	type As KeyBasedTreeEntryErrorType
) As IList(Of KeyBasedTreeEntryError)
public:
IList<KeyBasedTreeEntryError^>^ GetKeyBasedTreeEntryErrors(
	KeyBasedTreeEntryErrorType type
)
member GetKeyBasedTreeEntryErrors :
        type : KeyBasedTreeEntryErrorType -> IList<KeyBasedTreeEntryError>
Parameters
type KeyBasedTreeEntryErrorType
 The type of KeyBasedTreeEntryError to be returned.
Return Value
IList<KeyBasedTreeEntryError>
 An array of copies of the KeyBasedTreeEntryErrors contained in this object matching the type specified.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
GetKeyBasedTreeEntryErrors Overload
Autodesk.Revit.DB Namespace